#include "modding.h"
#include "global.h"

#include "apcommon.h"

#include "z64rumble.h"
#include "z64shrink_window.h"
#include "overlays/actors/ovl_Door_Warp1/z_door_warp1.h"
#include "overlays/actors/ovl_En_Clear_Tag/z_en_clear_tag.h"
#include "overlays/actors/ovl_En_Tanron1/z_en_tanron1.h"
#include "overlays/actors/ovl_Item_B_Heart/z_item_b_heart.h"

#define ODOLWA_LIMB_NONE 0x00
#define ODOLWA_LIMB_ROOT 0x01
#define ODOLWA_LIMB_MAX 0x34
#define ODOLWA_BUG_LIMB_MAX 0x15

struct Boss01;

#define FLAGS (ACTOR_FLAG_TARGETABLE | ACTOR_FLAG_UNFRIENDLY | ACTOR_FLAG_10 | ACTOR_FLAG_20)

#define THIS ((Boss01*)thisx)

#define ODOLWA_EFFECT_COUNT 100

// This actor has an array of timers in its instance, but it only ever uses the first entry.
#define TIMER_CURRENT_ACTION 0
#define TIMER_BUG_CURRENT_ACTION 0
#define TIMER_AFTERIMAGE_DESPAWN 0

#define ODOLWA_GET_TYPE(thisx) ((thisx)->params)
#define ODOLWA_GET_AFTERIMAGE_DESPAWN_TIMER(thisx) ((thisx)->world.rot.z)

#define ODOLWA_SHADOW_TEX_WIDTH 64
#define ODOLWA_SHADOW_TEX_HEIGHT 64
#define ODOLWA_SHADOW_TEX_SIZE ((s32)sizeof(u8[ODOLWA_SHADOW_TEX_HEIGHT][ODOLWA_SHADOW_TEX_WIDTH]))

typedef void (*Boss01ActionFunc)(struct Boss01*, PlayState*);

typedef enum OdolwaType {
    /*  0 */ ODOLWA_TYPE_ODOLWA,
    /* 10 */ ODOLWA_TYPE_BUG = 10,
    /* 35 */ ODOLWA_TYPE_AFTERIMAGE = 35
} OdolwaType;

typedef enum OdolwaBodyPart {
    /*  0 */ ODOLWA_BODYPART_HEAD,
    /*  1 */ ODOLWA_BODYPART_TORSO,
    /*  2 */ ODOLWA_BODYPART_PELVIS,
    /*  3 */ ODOLWA_BODYPART_LEFT_UPPER_ARM,
    /*  4 */ ODOLWA_BODYPART_LEFT_FOREARM,
    /*  5 */ ODOLWA_BODYPART_SHIELD,
    /*  6 */ ODOLWA_BODYPART_RIGHT_UPPER_ARM,
    /*  7 */ ODOLWA_BODYPART_RIGHT_FOREARM,
    /*  8 */ ODOLWA_BODYPART_SWORD,
    /*  9 */ ODOLWA_BODYPART_RIGHT_THIGH,
    /* 10 */ ODOLWA_BODYPART_RIGHT_SHIN,
    /* 11 */ ODOLWA_BODYPART_RIGHT_FOOT,
    /* 12 */ ODOLWA_BODYPART_LEFT_THIGH,
    /* 13 */ ODOLWA_BODYPART_LEFT_SHIN,
    /* 14 */ ODOLWA_BODYPART_LEFT_FOOT,
    /* 15 */ ODOLWA_BODYPART_MAX
} OdolwaBodyPart;

typedef enum OdolwaColliderBodyPart {
    /*  0 */ ODOLWA_COLLIDER_BODYPART_HEAD,
    /*  1 */ ODOLWA_COLLIDER_BODYPART_TORSO,
    /*  2 */ ODOLWA_COLLIDER_BODYPART_PELVIS,
    /*  3 */ ODOLWA_COLLIDER_BODYPART_LEFT_UPPER_ARM,
    /*  4 */ ODOLWA_COLLIDER_BODYPART_LEFT_FOREARM,
    /*  5 */ ODOLWA_COLLIDER_BODYPART_RIGHT_UPPER_ARM,
    /*  6 */ ODOLWA_COLLIDER_BODYPART_RIGHT_FOREARM,
    /*  7 */ ODOLWA_COLLIDER_BODYPART_LEFT_THIGH,
    /*  8 */ ODOLWA_COLLIDER_BODYPART_LEFT_SHIN,
    /*  9 */ ODOLWA_COLLIDER_BODYPART_RIGHT_THIGH,
    /* 10 */ ODOLWA_COLLIDER_BODYPART_RIGHT_SHIN,
    /* 11 */ ODOLWA_COLLIDER_BODYPART_MAX
} OdolwaColliderBodyPart;

typedef enum OdolwaSwordCollider {
    /* 0 */ ODOLWA_SWORD_COLLIDER_SWORD_BASE,
    /* 1 */ ODOLWA_SWORD_COLLIDER_SWORD_TIP,
    /* 2 */ ODOLWA_SWORD_COLLIDER_PELVIS,
    /* 3 */ ODOLWA_SWORD_COLLIDER_MAX
} OdolwaSwordCollider;

typedef enum OdolwaShieldCollider {
    /* 0 */ ODOLWA_SHIELD_COLLIDER_SHIELD,
    /* 1 */ ODOLWA_SHIELD_COLLIDER_MAX
} OdolwaShieldCollider;

typedef enum OdolwaKickAndShieldBashCollider {
    /* 0 */ ODOLWA_KICK_AND_SHIELD_BASH_COLLIDER_SHIELD,
    /* 1 */ ODOLWA_KICK_AND_SHIELD_BASH_COLLIDER_LEFT_FOOT,
    /* 2 */ ODOLWA_KICK_AND_SHIELD_BASH_COLLIDER_MAX
} OdolwaKickAndShieldBashCollider;

typedef struct Boss01 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s16 frameCounter;
    /* 0x148 */ s32 phaseFrameCounter;
    /* 0x14C */ union {
                    u8 jumpIfPlayerIsClose;
                    u8 shouldPerformFallingSlash;
                    u8 bugDrawDmgEffType;
                };
    /* 0x14E */ s16 timers[3];
    /* 0x154 */ f32 animMorphFrames1;
    /* 0x158 */ f32 animMorphFrames2;
    /* 0x15C */ s16 damageTimer;
    /* 0x15E */ s16 damageFlashTimer;
    /* 0x160 */ u8 isPerformingVerticalSlash; // set, but never checked
    /* 0x160 */ u8 landedFromJump;
    /* 0x162 */ u8 waitType;
    /* 0x163 */ u8 lookAtPlayer;
    /* 0x164 */ SkelAnime skelAnime;
    /* 0x1A8 */ f32 animEndFrame;
    /* 0x1AC */ f32 prevJumpVelocityY;
    /* 0x1B0 */ f32 runTargetPosAngularVelocityY;
    /* 0x1B4 */ f32 runTargetPosRotY;
    /* 0x1B8 */ u8 swordState;
    /* 0x1B9 */ u8 kickAndShieldBashCollisionEnabled;
    /* 0x1BA */ u8 swordAndShieldCollisionEnabled;
    /* 0x1BB */ u8 canGuardOrEvade;
    /* 0x1BC */ u8 bodyInvincibilityTimer;
    /* 0x1BE */ s16 disableCollisionTimer;
    /* 0x1C0 */ u8 afterimageSpawnFrameMask; // used as a bitmask with frameCounter to control how often to spawn afterimages
    /* 0x1C1 */ u8 hasPlayedSummonBugCs;
    /* 0x1C4 */ f32 additionalVelocityX;
    /* 0x1C8 */ f32 additionalVelocityZ;
    /* 0x1CC */ s16 headRotY;
    /* 0x1CE */ s16 headRotX;
    /* 0x1D0 */ Vec3s jointTable[ODOLWA_LIMB_MAX];
    /* 0x308 */ Vec3s morphTable[ODOLWA_LIMB_MAX];
    /* 0x440 */ Vec3f feetPos[2];
    /* 0x458 */ Vec3f pelvisPos;
    /* 0x464 */ Boss01ActionFunc actionFunc;
    /* 0x468 */ ColliderJntSph swordCollider;
    /* 0x488 */ ColliderJntSphElement swordColliderElements[ODOLWA_SWORD_COLLIDER_MAX];
    /* 0x548 */ ColliderJntSph shieldCollider;
    /* 0x568 */ ColliderJntSphElement shieldColliderElements[ODOLWA_SHIELD_COLLIDER_MAX];
    /* 0x5A8 */ ColliderJntSph bodyCollider;
    /* 0x5C8 */ ColliderJntSphElement bodyColliderElements[ODOLWA_COLLIDER_BODYPART_MAX];
    /* 0x888 */ ColliderJntSph kickAndShieldBashCollider;
    /* 0x8A8 */ ColliderJntSphElement kickAndShieldBashColliderElements[ODOLWA_KICK_AND_SHIELD_BASH_COLLIDER_MAX];
    /* 0x928 */ Vec3f bodyPartsPos[ODOLWA_BODYPART_MAX];
    /* 0x9DC */ union {
                    u32 cutsceneTimer;
                    u32 waitTimer;
                    u32 summonMothsTimer;
                };
    /* 0x9E0 */ s16 cutsceneState;
    /* 0x9E2 */ s16 subCamId;
    /* 0x9E4 */ Vec3f subCamEye;
    /* 0x9F0 */ Vec3f subCamAt;
    /* 0x9FC */ Vec3f subCamUp;
    /* 0xA08 */ Vec3f subCamEyeNext;
    /* 0xA14 */ f32 deathCsInitialSubCamRot;
    /* 0xA18 */ f32 deathCsSubCamRot;
    /* 0xA1C */ f32 subCamVelocity;
    /* 0xA20 */ f32 deathShrinkSpeed;
    /* 0xA24 */ f32 screenShakeOffsetY;
    /* 0xA28 */ f32 screenShakeMagnitude;
    /* 0xA2C */ ColliderCylinder bugACCollider;
    /* 0xA78 */ ColliderCylinder bugATCollider;
    /* 0xAC4 */ f32 bugDrawDmgEffScale;
    /* 0xAC8 */ f32 bugDrawDmgEffAlpha;
    /* 0xACC */ f32 drawDmgEffScale;
    /* 0xAD0 */ f32 drawDmgEffFrozenSteamScale;
    /* 0xAD4 */ f32 drawDmgEffAlpha;
    /* 0xAD8 */ u8 drawDmgEffType; 
    /* 0xAD9 */ u8 drawDmgEffState;
    /* 0xADA */ s16 drawDmgEffTimer;
} Boss01; // size = 0xADC

typedef enum {
    // Named based on the fact that everything with this damage effect deals zero damage. If this effect is given to an
    // attack that deals non-zero damage, it will behave exactly like ODOLWA_DMGEFF_DAMAGE.
    /* 0x0 */ ODOLWA_DMGEFF_IMMUNE,

    // Deals no damage, but turns Odolwa blue, stops all animations, and makes him wait in place for 40 frames.
    /* 0x1 */ ODOLWA_DMGEFF_STUN,

    // Deals damage and surrounds Odolwa with fire.
    /* 0x2 */ ODOLWA_DMGEFF_FIRE,

    // Behaves exactly like ODOLWA_DMGEFF_STUN, but also surrounds Odolwa with ice.
    /* 0x3 */ ODOLWA_DMGEFF_FREEZE,

    // Deals damage and surrounds Odolwa with yellow light orbs.
    /* 0x4 */ ODOLWA_DMGEFF_LIGHT_ORB,

    // Behaves exactly like ODOLWA_DMGEFF_STUN, but also surrounds Odolwa in electric sparks.
    /* 0xB */ ODOLWA_DMGEFF_ELECTRIC_STUN = 0xB,

    // Deals damage and surrounds Odolwa with blue light orbs.
    /* 0xC */ ODOLWA_DMGEFF_BLUE_LIGHT_ORB,

    // Deals damage and has no special effect.
    /* 0xD */ ODOLWA_DMGEFF_DAMAGE,

    // Deals damage and checks the timer that tracks how long Odolwa should be in his damaged state. If the timer is 7
    // or more, it will reset the timer to 20 frames keep Odolwa in the damaged state for longer. If the timer is 6 or
    // less, it will disable Odolwa's collision for 20 frames to ensure he can jump away without taking further damage.
    /* 0xE */ ODOLWA_DMGEFF_DAMAGE_TIMER_CHECK,

    // Deals no damage, but makes Odolwa play his dazed animation for 70 frames and be vulnerable to attacks.
    /* 0xF */ ODOLWA_DMGEFF_DAZE
} OdolwaDamageEffect;

static DamageTable sOdolwaDamageTable = {
    /* Deku Nut       */ DMG_ENTRY(0, ODOLWA_DMGEFF_STUN),
    /* Deku Stick     */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAZE),
    /* Horse trample  */ DMG_ENTRY(0, ODOLWA_DMGEFF_IMMUNE),
    /* Explosives     */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAMAGE_TIMER_CHECK),
    /* Zora boomerang */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAZE),
    /* Normal arrow   */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAZE),
    /* UNK_DMG_0x06   */ DMG_ENTRY(0, ODOLWA_DMGEFF_IMMUNE),
    /* Hookshot       */ DMG_ENTRY(0, ODOLWA_DMGEFF_IMMUNE),
    /* Goron punch    */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAMAGE_TIMER_CHECK),
    /* Sword          */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAMAGE_TIMER_CHECK),
    /* Goron pound    */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAZE),
    /* Fire arrow     */ DMG_ENTRY(2, ODOLWA_DMGEFF_FIRE),
    /* Ice arrow      */ DMG_ENTRY(2, ODOLWA_DMGEFF_FREEZE),
    /* Light arrow    */ DMG_ENTRY(2, ODOLWA_DMGEFF_LIGHT_ORB),
    /* Goron spikes   */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAZE),
    /* Deku spin      */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAZE),
    /* Deku bubble    */ DMG_ENTRY(0, ODOLWA_DMGEFF_STUN),
    /* Deku launch    */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAMAGE_TIMER_CHECK),
    /* UNK_DMG_0x12   */ DMG_ENTRY(0, ODOLWA_DMGEFF_STUN),
    /* Zora barrier   */ DMG_ENTRY(0, ODOLWA_DMGEFF_ELECTRIC_STUN),
    /* Normal shield  */ DMG_ENTRY(0, ODOLWA_DMGEFF_IMMUNE),
    /* Light ray      */ DMG_ENTRY(0, ODOLWA_DMGEFF_IMMUNE),
    /* Thrown object  */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAZE),
    /* Zora punch     */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAMAGE_TIMER_CHECK),
    /* Spin attack    */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAMAGE),
    /* Sword beam     */ DMG_ENTRY(2, ODOLWA_DMGEFF_BLUE_LIGHT_ORB),
    /* Normal Roll    */ DMG_ENTRY(69, ODOLWA_DMGEFF_BLUE_LIGHT_ORB),
    /* UNK_DMG_0x1B   */ DMG_ENTRY(0, ODOLWA_DMGEFF_IMMUNE),
    /* UNK_DMG_0x1C   */ DMG_ENTRY(0, ODOLWA_DMGEFF_IMMUNE),
    /* Unblockable    */ DMG_ENTRY(0, ODOLWA_DMGEFF_IMMUNE),
    /* UNK_DMG_0x1E   */ DMG_ENTRY(0, ODOLWA_DMGEFF_IMMUNE),
    /* Powder Keg     */ DMG_ENTRY(1, ODOLWA_DMGEFF_DAMAGE_TIMER_CHECK),
};

// The limbs referenced here are not used. The spheres are positioned manually by Boss01_PostLimbDraw.
static ColliderJntSphElementInit sSwordColliderJntSphElementsInit[3] = {
    {
        {
            ELEMTYPE_UNK2,
            { 0xF7CFFFFF, 0x04, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_NONE, { { 0, 0, 0 }, 35 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK2,
            { 0xF7CFFFFF, 0x04, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_NONE, { { 0, 0, 0 }, 35 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK2,
            { 0xF7CFFFFF, 0x04, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_NONE, { { 0, 0, 0 }, 70 }, 100 },
    },
};

static ColliderJntSphInit sSwordColliderJntSphInit = {
    {
        COLTYPE_METAL,
        AT_ON | AT_TYPE_ENEMY,
        AC_ON | AC_HARD | AC_TYPE_PLAYER,
        OC1_ON | OC1_TYPE_PLAYER,
        OC2_TYPE_1,
        COLSHAPE_JNTSPH,
    },
    ARRAY_COUNT(sSwordColliderJntSphElementsInit),
    sSwordColliderJntSphElementsInit,
};

// The limbs referenced here are not used. The spheres are positioned manually by Boss01_PostLimbDraw.
static ColliderJntSphElementInit sShieldColliderJntSphElementsInit[1] = {
    {
        {
            ELEMTYPE_UNK2,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_NONE, { { 0, 0, 0 }, 36 }, 100 },
    },
};

static ColliderJntSphInit sShieldColliderJntSphInit = {
    {
        COLTYPE_METAL,
        AT_ON | AT_TYPE_ENEMY,
        AC_ON | AC_HARD | AC_TYPE_PLAYER,
        OC1_ON | OC1_TYPE_PLAYER,
        OC2_TYPE_1,
        COLSHAPE_JNTSPH,
    },
    ARRAY_COUNT(sShieldColliderJntSphElementsInit),
    sShieldColliderJntSphElementsInit,
};

// The limbs referenced here are not used. The spheres are positioned manually by Boss01_PostLimbDraw.
static ColliderJntSphElementInit sBodyColliderJntSphElementsInit[11] = {
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_NONE, { { 0, 0, 0 }, 20 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_ROOT, { { 0, 0, 0 }, 30 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_ROOT, { { 0, 0, 0 }, 25 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_ROOT, { { 0, 0, 0 }, 15 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_ROOT, { { 0, 0, 0 }, 15 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_ROOT, { { 0, 0, 0 }, 15 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_ROOT, { { 0, 0, 0 }, 15 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_ROOT, { { 0, 0, 0 }, 15 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_ROOT, { { 0, 0, 0 }, 15 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_ROOT, { { 0, 0, 0 }, 15 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_ROOT, { { 0, 0, 0 }, 15 }, 100 },
    },
};

static ColliderJntSphInit sBodyColliderJntSphInit = {
    {
        COLTYPE_HIT3,
        AT_ON | AT_TYPE_ENEMY,
        AC_ON | AC_TYPE_PLAYER,
        OC1_ON | OC1_TYPE_PLAYER,
        OC2_TYPE_1,
        COLSHAPE_JNTSPH,
    },
    ARRAY_COUNT(sBodyColliderJntSphElementsInit),
    sBodyColliderJntSphElementsInit,
};

// The limbs referenced here are not used. The spheres are positioned manually by Boss01_PostLimbDraw.
static ColliderJntSphElementInit sKickAndShieldBashColliderJntSphElementsInit[2] = {
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x04, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_HARD,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_NONE, { { 0, 0, 0 }, 36 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x04, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_HARD,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_NONE, { { 0, 0, 0 }, 36 }, 100 },
    },
};

static ColliderJntSphInit sKickAndShieldBashColliderJntSphInit = {
    {
        COLTYPE_HIT3,
        AT_ON | AT_TYPE_ENEMY,
        AC_ON | AC_TYPE_PLAYER,
        OC1_ON | OC1_TYPE_PLAYER,
        OC2_TYPE_1,
        COLSHAPE_JNTSPH,
    },
    ARRAY_COUNT(sKickAndShieldBashColliderJntSphElementsInit),
    sKickAndShieldBashColliderJntSphElementsInit,
};

static ColliderCylinderInit sBugACColliderCylinderInit = {
    {
        COLTYPE_HIT3,
        AT_ON | AT_TYPE_ENEMY,
        AC_ON | AC_TYPE_PLAYER,
        OC1_ON | OC1_TYPE_ALL,
        OC2_TYPE_1,
        COLSHAPE_CYLINDER,
    },
    {
        ELEMTYPE_UNK3,
        { 0xF7CFFFFF, 0x00, 0x04 },
        { 0xF7FFFFFF, 0x00, 0x00 },
        TOUCH_ON | TOUCH_SFX_NORMAL,
        BUMP_ON,
        OCELEM_ON,
    },
    { 15, 15, 10, { 0, 0, 0 } },
};

static ColliderCylinderInit sBugATColliderCylinderInit = {
    {
        COLTYPE_HIT3,
        AT_ON | AT_TYPE_ENEMY,
        AC_ON | AC_TYPE_PLAYER,
        OC1_ON | OC1_TYPE_ALL,
        OC2_TYPE_1,
        COLSHAPE_CYLINDER,
    },
    {
        ELEMTYPE_UNK3,
        { 0xF7CFFFFF, 0x00, 0x04 },
        { 0xF7FFFFFF, 0x00, 0x00 },
        TOUCH_ON | TOUCH_SFX_NORMAL,
        BUMP_ON,
        OCELEM_ON,
    },
    { 8, 15, 10, { 0, 0, 0 } },
};

typedef enum {
    // Named based on the fact that everything with this damage effect deals zero damage. If this effect is given to an
    // attack that deals non-zero damage, it will behave exactly like BUG_DMGEFF_DAMAGE.
    /* 0x0 */ BUG_DMGEFF_IMMUNE,

    // Deals no damage, but turns the bug blue, stops all animations, and makes it wait in place for 40 frames.
    /* 0x1 */ BUG_DMGEFF_STUN,

    // Named after the only attack that uses it. Behaves exactly like BUG_DMGEFF_DAMAGE.
    /* 0x2 */ BUG_DMGEFF_FIRE_ARROW,

    // Named after the only attack that uses it. Behaves exactly like BUG_DMGEFF_DAMAGE.
    /* 0x3 */ BUG_DMGEFF_ICE_ARROW,

    // Named after the only attack that uses it. Behaves exactly like BUG_DMGEFF_DAMAGE.
    /* 0x4 */ BUG_DMGEFF_LIGHT_ARROW,

    // Named after the only two attacks that use it. Behaves exactly like BUG_DMGEFF_DAMAGE.
    /* 0xD */ BUG_DMGEFF_SPIN_ATTACK_AND_SWORD_BEAM = 0xD,

    // Named after the only attack that uses it. Behaves exactly like BUG_DMGEFF_DAMAGE.
    /* 0xE */ BUG_DMGEFF_ZORA_PUNCH,

    // Deals damage and has no special effect.
    /* 0xF */ BUG_DMGEFF_DAMAGE
} BugDamageEffect;

static DamageTable sBugDamageTable = {
    /* Deku Nut       */ DMG_ENTRY(0, BUG_DMGEFF_STUN),
    /* Deku Stick     */ DMG_ENTRY(1, BUG_DMGEFF_DAMAGE),
    /* Horse trample  */ DMG_ENTRY(0, BUG_DMGEFF_IMMUNE),
    /* Explosives     */ DMG_ENTRY(2, BUG_DMGEFF_DAMAGE),
    /* Zora boomerang */ DMG_ENTRY(0, BUG_DMGEFF_STUN),
    /* Normal arrow   */ DMG_ENTRY(2, BUG_DMGEFF_DAMAGE),
    /* UNK_DMG_0x06   */ DMG_ENTRY(0, BUG_DMGEFF_IMMUNE),
    /* Hookshot       */ DMG_ENTRY(0, BUG_DMGEFF_IMMUNE),
    /* Goron punch    */ DMG_ENTRY(1, BUG_DMGEFF_DAMAGE),
    /* Sword          */ DMG_ENTRY(1, BUG_DMGEFF_DAMAGE),
    /* Goron pound    */ DMG_ENTRY(1, BUG_DMGEFF_DAMAGE),
    /* Fire arrow     */ DMG_ENTRY(2, BUG_DMGEFF_FIRE_ARROW),
    /* Ice arrow      */ DMG_ENTRY(2, BUG_DMGEFF_ICE_ARROW),
    /* Light arrow    */ DMG_ENTRY(2, BUG_DMGEFF_LIGHT_ARROW),
    /* Goron spikes   */ DMG_ENTRY(1, BUG_DMGEFF_DAMAGE),
    /* Deku spin      */ DMG_ENTRY(0, BUG_DMGEFF_STUN),
    /* Deku bubble    */ DMG_ENTRY(0, BUG_DMGEFF_STUN),
    /* Deku launch    */ DMG_ENTRY(1, BUG_DMGEFF_DAMAGE),
    /* UNK_DMG_0x12   */ DMG_ENTRY(0, BUG_DMGEFF_STUN),
    /* Zora barrier   */ DMG_ENTRY(0, BUG_DMGEFF_STUN),
    /* Normal shield  */ DMG_ENTRY(0, BUG_DMGEFF_IMMUNE),
    /* Light ray      */ DMG_ENTRY(0, BUG_DMGEFF_IMMUNE),
    /* Thrown object  */ DMG_ENTRY(1, BUG_DMGEFF_DAMAGE),
    /* Zora punch     */ DMG_ENTRY(1, BUG_DMGEFF_ZORA_PUNCH),
    /* Spin attack    */ DMG_ENTRY(2, BUG_DMGEFF_SPIN_ATTACK_AND_SWORD_BEAM),
    /* Sword beam     */ DMG_ENTRY(2, BUG_DMGEFF_SPIN_ATTACK_AND_SWORD_BEAM),
    /* Normal Roll    */ DMG_ENTRY(69, BUG_DMGEFF_DAMAGE),
    /* UNK_DMG_0x1B   */ DMG_ENTRY(0, BUG_DMGEFF_IMMUNE),
    /* UNK_DMG_0x1C   */ DMG_ENTRY(0, BUG_DMGEFF_IMMUNE),
    /* Unblockable    */ DMG_ENTRY(0, BUG_DMGEFF_IMMUNE),
    /* UNK_DMG_0x1E   */ DMG_ENTRY(0, BUG_DMGEFF_IMMUNE),
    /* Powder Keg     */ DMG_ENTRY(1, BUG_DMGEFF_DAMAGE),
};

typedef enum {
    /* 0 */ ODOLWA_EFFECT_NONE,
    /* 1 */ ODOLWA_EFFECT_FALLING_BLOCK,   // The blocks that fall from the ceiling and their fragments
    /* 3 */ ODOLWA_EFFECT_RING_OF_FIRE = 3 // The ring of fire that surrounds the player
} OdolwaEffectType;

typedef struct {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ Vec3f velocity;
    /* 0x18 */ f32 gravity;
    /* 0x1C */ s16 rotX;
    /* 0x1E */ s16 rotY;
    /* 0x20 */ UNK_TYPE1 unk_20[0x8];
    /* 0x28 */ u8 type;
    /* 0x2A */ s16 timer;
    /* 0x2C */ s16 isFallingBlockFragment;
    /* 0x2E */ s16 angularVelocityX;
    /* 0x30 */ s16 angularVelocityY;
    /* 0x34 */ f32 scale;
    /* 0x38 */ f32 alpha;
} OdolwaEffect; // size = 0x3C

typedef enum {
    /*   0 */ ODOLWA_WAIT_READY,
    /*   1 */ ODOLWA_WAIT_SPIN_SWORD,
    /*   2 */ ODOLWA_WAIT_VERTICAL_HOP,
    /*   3 */ ODOLWA_WAIT_SHAKE_DANCE,
    /*   4 */ ODOLWA_WAIT_UP_AND_DOWN_DANCE,
    /*   5 */ ODOLWA_WAIT_ARM_SWING_DANCE,
    /*   6 */ ODOLWA_WAIT_THRUST_ATTACK,
    /*   7 */ ODOLWA_WAIT_DOUBLE_SLASH,
    /*   8 */ ODOLWA_WAIT_SIDE_TO_SIDE_HOP,
    /*   9 */ ODOLWA_WAIT_SIDE_TO_SIDE_DANCE,
    /*  10 */ ODOLWA_WAIT_SPIN_DANCE,
    /*  11 */ ODOLWA_WAIT_JUMP_DANCE,
    /*  12 */ ODOLWA_WAIT_MAX,

    // This doesn't correspond to an actual wait action that Odolwa can perform, but it can be passed as a parameter to
    // Boss01_SetupWait to randomly select between one of Odolwa's available wait types (as well as having a random
    // chance to summon moths instead), assuming that the fight is in its second phase.
    /* 100 */ ODOLWA_WAIT_RANDOM = 100
} OdolwaWaitType;

typedef enum {
