#include "global.h"
#include "modding.h"

#include "apcommon.h"

#include "z64snap.h"
#include "z64msgevent.h"

struct EnShn;

typedef void (*EnShnActionFunc)(struct EnShn*, PlayState*);

#define BURLY_GUY_LIMB_MAX 0x10

typedef struct EnShn {
    /* 0x000 */ Actor actor;
    /* 0x144 */ EnShnActionFunc actionFunc;
    /* 0x148 */ SkelAnime skelAnime;
    /* 0x18C */ UNK_TYPE1 pad_18C[0x4C];
    /* 0x1D8 */ u16 unk_1D8;
    /* 0x1DA */ u16 unk_1DA;
    /* 0x1DC */ MsgScript* msgScript;
    /* 0x1E0 */ s32 msgScriptPos;
    /* 0x1E4 */ Player* shnPlayerRef;
    /* 0x1E8 */ Vec3f unk_1E8;
    /* 0x1F4 */ Vec3s unk_1F4;
    /* 0x1FA */ Vec3s jointTable[BURLY_GUY_LIMB_MAX];
    /* 0x25A */ Vec3s morphTable[BURLY_GUY_LIMB_MAX];
    /* 0x2BA */ s16 unk_2BA;
    /* 0x2BC */ s16 unk_2BC;
    /* 0x2BE */ s16 unk_2BE;
    /* 0x2C0 */ s16 unk_2C0;
    /* 0x2C2 */ s16 unk_2C2;
    /* 0x2C4 */ s16 unk_2C4;
    /* 0x2C6 */ s16 unk_2C6;
    /* 0x2C8 */ s16 unk_2C8;
    /* 0x2CA */ s16 unk_2CA;
    /* 0x2CC */ f32 animPlaySpeed;
    /* 0x2D0 */ f32 unk_2D0;
    /* 0x2D4 */ f32 unk_2D4;
    /* 0x2D8 */ MsgScriptCallback msgScriptCallback;
    /* 0x2DC */ s32 prevTalkState;
    /* 0x2E0 */ s32 unk_2E0;
    /* 0x2E4 */ s32 unk_2E4;
    /* 0x2E8 */ s32 animIndex;
    /* 0x2EC */ s32 unk_2EC;
} EnShn; // size = 0x2F0

static MsgScript D_80AE6F00[] = {
    /* 0x0000 0x05 */ MSCRIPT_CMD_CHECK_WEEK_EVENT_REG(WEEKEVENTREG_23_08, 0x0010 - 0x0005),
    /* 0x0005 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09C4),
    /* 0x0008 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0009 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09C5),
    /* 0x000C 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x000D 0x03 */ MSCRIPT_CMD_SET_WEEK_EVENT_REG(WEEKEVENTREG_23_08),
    /* 0x0010 0x03 */ MSCRIPT_CMD_CHECK_DEKU(0x019F - 0x0013),
    /* 0x0013 0x03 */ MSCRIPT_CMD_CHECK_HUMAN(0x01A4 - 0x0016),
    /* 0x0016 0x03 */ MSCRIPT_CMD_JUMP(0x019F - 0x0019),
    /* 0x0019 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x00FF),
    /* 0x001C 0x09 */ MSCRIPT_CMD_CHECK_ITEM_ACTION(PLAYER_IA_PICTOGRAPH_BOX, 0x0, 0x013A - 0x0025, 0x016C - 0x0025),
    /* 0x0025 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK_CONTINUE(0x003A - 0x0028),
    /* 0x0028 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK_CONTINUE(0x0044 - 0x002B),
    /* 0x002B 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK_CONTINUE(0x005B - 0x002E),
    /* 0x002E 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK_CONTINUE(0x008E - 0x0031),
    /* 0x0031 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK_CONTINUE(0x00C7 - 0x0034),
    /* 0x0034 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK_CONTINUE(0x006A - 0x0037),
    /* 0x0037 0x03 */ MSCRIPT_CMD_JUMP(0x0081 - 0x003A),
    /* 0x003A 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09E7),
    /* 0x003D 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x003E 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x0041 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0042 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x0043 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x0044 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09CB),
    /* 0x0047 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0048 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x004B 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x004C 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09CC),
    /* 0x004F 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0050 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09CD),
    /* 0x0053 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0054 0x07 */ MSCRIPT_CMD_CHECK_TEXT_CHOICE(0x0100 - 0x005B, 0x0126 - 0x005B, 0x0126 - 0x005B),
    /* 0x005B 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09D1),
    /* 0x005E 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x005F 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x0062 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0063 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09D2),
    /* 0x0066 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0067 0x03 */ MSCRIPT_CMD_JUMP(0x0050 - 0x006A),

    /* 0x006A 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09D3),
    /* 0x006D 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x006E 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x0071 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0072 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09D4),
    /* 0x0075 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0076 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09D5),
    /* 0x0079 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x007A 0x07 */ MSCRIPT_CMD_CHECK_TEXT_CHOICE(0x0113 - 0x0081, 0x0133 - 0x0081, 0x0133 - 0x0081),
    /* 0x0081 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09D9),
    /* 0x0084 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0085 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x0088 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0089 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DA),
    /* 0x008C 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x008D 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x008E 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09E8),
    /* 0x0091 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0092 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x0095 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0096 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09E9),
    /* 0x0099 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x009A 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09EA),
    /* 0x009D 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x009E 0x05 */ MSCRIPT_CMD_CHECK_WEEK_EVENT_REG(WEEKEVENTREG_87_04, 0x00BA - 0x00A3),
    /* 0x00A3 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x00A4 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_HEART_PIECE, 0x0),
    /* 0x00A9 0x03 */ MSCRIPT_CMD_SET_COLLECTIBLE(0x000C),
    /* 0x00AC 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00AD 0x03 */ MSCRIPT_CMD_SET_WEEK_EVENT_REG(WEEKEVENTREG_87_04),
    /* 0x00B0 0x03 */ MSCRIPT_CMD_AUTOTALK(0x0),
    /* 0x00B3 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09EB),
    /* 0x00B6 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00B7 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x00B8 0x01 */ MSCRIPT_CMD_UNSET_AUTOTALK(),
    /* 0x00B9 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x00BA 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    // /* 0x00BB 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_RUPEE_SILVER, 0x0),
    /* 0x00BB 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_HEART_PIECE, 0x0),
    /* 0x00C0 0x03 */ MSCRIPT_CMD_SET_COLLECTIBLE(0x0006),
    /* 0x00C3 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00C4 0x03 */ MSCRIPT_CMD_AUTOTALK(0x00B3 - 0x00C7),

    /* 0x00C7 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09EC),
    /* 0x00CA 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00CB 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x00CE 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00CF 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09ED),
    /* 0x00D2 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00D3 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09EE),
    /* 0x00D6 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00D7 0x05 */ MSCRIPT_CMD_CHECK_WEEK_EVENT_REG(WEEKEVENTREG_87_04, 0x00F3 - 0x00DC),
    /* 0x00DC 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x00DD 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_HEART_PIECE, 0x0),
    /* 0x00E2 0x03 */ MSCRIPT_CMD_SET_COLLECTIBLE(0x000C),
    /* 0x00E5 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00E6 0x03 */ MSCRIPT_CMD_SET_WEEK_EVENT_REG(WEEKEVENTREG_87_04),
    /* 0x00E9 0x03 */ MSCRIPT_CMD_AUTOTALK(0x0),
    /* 0x00EC 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09EF),
    /* 0x00EF 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00F0 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x00F1 0x01 */ MSCRIPT_CMD_UNSET_AUTOTALK(),
    /* 0x00F2 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x00F3 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    // /* 0x00F4 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_RUPEE_SILVER, 0x0),
    /* 0x00F4 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_HEART_PIECE, 0x0),
    /* 0x00F9 0x03 */ MSCRIPT_CMD_SET_COLLECTIBLE(0x0006),
    /* 0x00FC 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00FD 0x03 */ MSCRIPT_CMD_AUTOTALK(0x00EC - 0x0100),

    /* 0x0100 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x0101 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_RUPEE_RED, 0x0),
    /* 0x0106 0x03 */ MSCRIPT_CMD_SET_COLLECTIBLE(0x0004),
    /* 0x0109 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x010A 0x03 */ MSCRIPT_CMD_AUTOTALK(0x0),
    /* 0x010D 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09CE),
    /* 0x0110 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0111 0x01 */ MSCRIPT_CMD_UNSET_AUTOTALK(),
    /* 0x0112 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x0113 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x0114 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_RUPEE_BLUE, 0x0),
    /* 0x0119 0x03 */ MSCRIPT_CMD_SET_COLLECTIBLE(0x0002),
    /* 0x011C 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x011D 0x03 */ MSCRIPT_CMD_AUTOTALK(0x0),
    /* 0x0120 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09D8),
    /* 0x0123 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0124 0x01 */ MSCRIPT_CMD_UNSET_AUTOTALK(),
    /* 0x0125 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x0126 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0127 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09CF),
    /* 0x012A 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x012B 0x03 */ MSCRIPT_CMD_SET_EVENT_INF(EVENTINF_50),
    /* 0x012E 0x01 */ MSCRIPT_CMD_PAUSE(),
    /* 0x012F 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK(0x0),
    /* 0x0132 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x0133 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09D6),
    /* 0x0136 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0137 0x03 */ MSCRIPT_CMD_JUMP(0x012B - 0x013A),

    /* 0x013A 0x05 */ MSCRIPT_CMD_CHECK_WEEK_EVENT_REG(WEEKEVENTREG_55_40, 0x015B - 0x013F),
    /* 0x013F 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09DB),
    /* 0x0142 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0143 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x0146 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0147 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DC),
    /* 0x014A 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x014B 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DD),
    /* 0x014E 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x014F 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DE),
    /* 0x0152 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0153 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DF),
    /* 0x0156 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0157 0x03 */ MSCRIPT_CMD_SET_WEEK_EVENT_REG(WEEKEVENTREG_55_40),
    /* 0x015A 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x015B 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09E0),
    /* 0x015E 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x015F 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x0162 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0163 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09E1),
    /* 0x0166 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0167 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09E2),
    /* 0x016A 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x016B 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x016C 0x05 */ MSCRIPT_CMD_CHECK_WEEK_EVENT_REG(WEEKEVENTREG_55_40, 0x0189 - 0x0171),
    /* 0x0171 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09DB),
    /* 0x0174 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0175 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DC),
    /* 0x0178 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0179 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DD),
    /* 0x017C 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x017D 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DE),
    /* 0x0180 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0181 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DF),
    /* 0x0184 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0185 0x03 */ MSCRIPT_CMD_SET_WEEK_EVENT_REG(WEEKEVENTREG_55_40),
    /* 0x0188 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x0189 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09E0),
    /* 0x018C 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x018D 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09E1),
    /* 0x0190 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0191 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09E2),
    /* 0x0194 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0195 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x0196 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09C9),
    /* 0x0199 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x019A 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09CA),
    /* 0x019D 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x019E 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x019F 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09C6),
    /* 0x01A2 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x01A3 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x01A4 0x05 */ MSCRIPT_CMD_CHECK_WEEK_EVENT_REG(WEEKEVENTREG_CLEARED_WOODFALL_TEMPLE, 0x0196 - 0x01A9),
    /* 0x01A9 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09C8),
    /* 0x01AC 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x01AD 0x03 */ MSCRIPT_CMD_JUMP(0x0019 - 0x01B0),
};

static MsgScript D_80AE70B0[] = {
    /* 0x0000 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09D0),
    /* 0x0003 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0004 0x01 */ MSCRIPT_CMD_UNSET_AUTOTALK(),
    /* 0x0005 0x01 */ MSCRIPT_CMD_DONE(),
};

static MsgScript D_80AE70B8[] = {
    /* 0x0000 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK_CONTINUE(0x0015 - 0x0003),
    /* 0x0003 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK_CONTINUE(0x001B - 0x0006),
    /* 0x0006 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK_CONTINUE(0x0031 - 0x0009),
    /* 0x0009 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK_CONTINUE(0x0061 - 0x000C),
    /* 0x000C 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK_CONTINUE(0x0099 - 0x000F),
    /* 0x000F 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK_CONTINUE(0x003F - 0x0012),
    /* 0x0012 0x03 */ MSCRIPT_CMD_JUMP(0x0055 - 0x0015),
    /* 0x0015 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09E7),
    /* 0x0018 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0019 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x001A 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x001B 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09CB),
    /* 0x001E 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x0021 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0022 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09CC),
    /* 0x0025 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0026 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09CD),
    /* 0x0029 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x002A 0x07 */ MSCRIPT_CMD_CHECK_TEXT_CHOICE(0x00D1 - 0x0031, 0x00F7 - 0x0031, 0x00F7 - 0x0031),
    /* 0x0031 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09D1),
    /* 0x0034 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x0037 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0038 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09D2),
    /* 0x003B 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x003C 0x03 */ MSCRIPT_CMD_JUMP(0x0026 - 0x003F),

    /* 0x003F 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09D3),
    /* 0x0042 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x0045 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0046 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09D4),
    /* 0x0049 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x004A 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09D5),
    /* 0x004D 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x004E 0x07 */ MSCRIPT_CMD_CHECK_TEXT_CHOICE(0x00E4 - 0x0055, 0x0104 - 0x0055, 0x0104 - 0x0055),
    /* 0x0055 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09D9),
    /* 0x0058 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x005B 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x005C 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DA),
    /* 0x005F 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0060 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x0061 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09E8),
    /* 0x0064 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x0067 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0068 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09E9),
    /* 0x006B 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x006C 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09EA),
    /* 0x006F 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0070 0x05 */ MSCRIPT_CMD_CHECK_WEEK_EVENT_REG(WEEKEVENTREG_87_04, 0x008C - 0x0075),
    /* 0x0075 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x0076 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_HEART_PIECE, 0x0),
    /* 0x007B 0x03 */ MSCRIPT_CMD_SET_COLLECTIBLE(0x000C),
    /* 0x007E 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x007F 0x03 */ MSCRIPT_CMD_SET_WEEK_EVENT_REG(WEEKEVENTREG_87_04),
    /* 0x0082 0x03 */ MSCRIPT_CMD_AUTOTALK(0x0),
    /* 0x0085 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09EB),
    /* 0x0088 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0089 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x008A 0x01 */ MSCRIPT_CMD_UNSET_AUTOTALK(),
    /* 0x008B 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x008C 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    // /* 0x008D 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_RUPEE_SILVER, 0x0),
    /* 0x008D 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_HEART_PIECE, 0x0),
    /* 0x0092 0x03 */ MSCRIPT_CMD_SET_COLLECTIBLE(0x0006),
    /* 0x0095 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0096 0x03 */ MSCRIPT_CMD_AUTOTALK(0x0085 - 0x0099),

    /* 0x0099 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09EC),
    /* 0x009C 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x009F 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00A0 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09ED),
    /* 0x00A3 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00A4 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09EE),
    /* 0x00A7 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00A8 0x05 */ MSCRIPT_CMD_CHECK_WEEK_EVENT_REG(WEEKEVENTREG_87_08, 0x00C4 - 0x00AD),
    /* 0x00AD 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x00AE 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_HEART_PIECE, 0x0),
    /* 0x00B3 0x03 */ MSCRIPT_CMD_SET_COLLECTIBLE(0x000C),
    /* 0x00B6 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00B7 0x03 */ MSCRIPT_CMD_SET_WEEK_EVENT_REG(WEEKEVENTREG_87_08),
    /* 0x00BA 0x03 */ MSCRIPT_CMD_AUTOTALK(0x0),
    /* 0x00BD 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09EF),
    /* 0x00C0 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00C1 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x00C2 0x01 */ MSCRIPT_CMD_UNSET_AUTOTALK(),
    /* 0x00C3 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x00C4 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    // /* 0x00C5 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_RUPEE_SILVER, 0x0),
    /* 0x00C5 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_HEART_PIECE, 0x0),
    /* 0x00CA 0x03 */ MSCRIPT_CMD_SET_COLLECTIBLE(0x0006),
    /* 0x00CD 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00CE 0x03 */ MSCRIPT_CMD_AUTOTALK(0x00BD - 0x00D1),

    /* 0x00D1 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x00D2 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_RUPEE_RED, 0x0),
    /* 0x00D7 0x03 */ MSCRIPT_CMD_SET_COLLECTIBLE(0x0004),
    /* 0x00DA 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00DB 0x03 */ MSCRIPT_CMD_AUTOTALK(0x0),
    /* 0x00DE 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09CE),
    /* 0x00E1 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00E2 0x01 */ MSCRIPT_CMD_UNSET_AUTOTALK(),
    /* 0x00E3 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x00E4 0x01 */ MSCRIPT_CMD_CLOSE_TEXT(),
    /* 0x00E5 0x05 */ MSCRIPT_CMD_OFFER_ITEM(GI_RUPEE_BLUE, 0x0),
    /* 0x00EA 0x03 */ MSCRIPT_CMD_SET_COLLECTIBLE(0x0002),
    /* 0x00ED 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00EE 0x03 */ MSCRIPT_CMD_AUTOTALK(0x0),
    /* 0x00F1 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09D8),
    /* 0x00F4 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00F5 0x01 */ MSCRIPT_CMD_UNSET_AUTOTALK(),
    /* 0x00F6 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x00F7 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00F8 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09CF),
    /* 0x00FB 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x00FC 0x03 */ MSCRIPT_CMD_SET_EVENT_INF(EVENTINF_50),
    /* 0x00FF 0x01 */ MSCRIPT_CMD_PAUSE(),
    /* 0x0100 0x03 */ MSCRIPT_CMD_CHECK_CALLBACK(0x0),
    /* 0x0103 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x0104 0x03 */ MSCRIPT_CMD_BEGIN_TEXT(0x09D6),
    /* 0x0107 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0108 0x03 */ MSCRIPT_CMD_JUMP(0x00FC - 0x010B),
};

static MsgScript D_80AE71C4[] = {
    /* 0x0000 0x05 */ MSCRIPT_CMD_CHECK_WEEK_EVENT_REG(WEEKEVENTREG_55_40, 0x0021 - 0x0005),
    /* 0x0005 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09DB),
    /* 0x0008 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0009 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x000C 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x000D 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DC),
    /* 0x0010 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0011 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DD),
    /* 0x0014 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0015 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DE),
    /* 0x0018 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0019 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09DF),
    /* 0x001C 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x001D 0x03 */ MSCRIPT_CMD_SET_WEEK_EVENT_REG(WEEKEVENTREG_55_40),
    /* 0x0020 0x01 */ MSCRIPT_CMD_DONE(),

    /* 0x0021 0x03 */ MSCRIPT_CMD_PLAYER_TALK(0x09E0),
    /* 0x0024 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0025 0x03 */ MSCRIPT_CMD_JUMP_3(0x0),
    /* 0x0028 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0029 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09E1),
    /* 0x002C 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x002D 0x03 */ MSCRIPT_CMD_CONTINUE_TEXT(0x09E2),
    /* 0x0030 0x01 */ MSCRIPT_CMD_AWAIT_TEXT(),
    /* 0x0031 0x01 */ MSCRIPT_CMD_DONE(),
};

s32 func_80AE6704(Actor* thisx, PlayState* play);

RECOMP_PATCH MsgScript* func_80AE6880(EnShn* this, PlayState* play) {
// RECOMP_PATCH MsgScript* EnShn_GetMsgScript(EnShn* this, PlayState* play) {
    if (this->unk_2BE != 0) {
        return D_80AE70B0;
    }
    if (this->unk_1D8 & 0x80) {
        this->msgScriptCallback = func_80AE6704;
        return D_80AE70B8;
    }
    if (this->unk_1D8 & 0x100) {
        return D_80AE71C4;
    }
    this->msgScriptCallback = func_80AE6704;
    return D_80AE6F00;
}